Masmiseim36/nxpSDK/boards/frdmimxrt1186/ecat_examples/dual_cores_servo_motor/cm7/pin_mux.h
/*
 * Copyright 2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_EMC_B1_11 (coord F2), LED_GREEN_CTL */
/* Routed pin properties */
#define BOARD_INITPINS_LED_GREEN_CTL_PERIPHERAL                           RGPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_LED_GREEN_CTL_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LED_GREEN_CTL_CHANNEL                                 11U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_GREEN_CTL_GPIO                                 RGPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_GREEN_CTL_INIT_GPIO_VALUE                          0U   /*!< GPIO output initial state */
#define BOARD_INITPINS_LED_GREEN_CTL_GPIO_PIN                                11U   /*!< GPIO pin number */
#define BOARD_INITPINS_LED_GREEN_CTL_GPIO_PIN_MASK                   (1U << 11U)   /*!< GPIO pin mask */

/* GPIO_AON_18 (coord E6), TP_J3_16 */
/* Routed pin properties */
#define BOARD_INITPINS_TP_J3_16_PERIPHERAL                                RGPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_TP_J3_16_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TP_J3_16_CHANNEL                                      18U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TP_J3_16_GPIO                                      RGPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TP_J3_16_INIT_GPIO_VALUE                               0U   /*!< GPIO output initial state */
#define BOARD_INITPINS_TP_J3_16_GPIO_PIN                                     18U   /*!< GPIO pin number */
#define BOARD_INITPINS_TP_J3_16_GPIO_PIN_MASK                        (1U << 18U)   /*!< GPIO pin mask */

/* GPIO_AON_19 (coord D5), TP_J3_18 */
/* Routed pin properties */
#define BOARD_INITPINS_TP_J3_18_PERIPHERAL                                RGPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_TP_J3_18_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TP_J3_18_CHANNEL                                      19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TP_J3_18_GPIO                                      RGPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TP_J3_18_INIT_GPIO_VALUE                               0U   /*!< GPIO output initial state */
#define BOARD_INITPINS_TP_J3_18_GPIO_PIN                                     19U   /*!< GPIO pin number */
#define BOARD_INITPINS_TP_J3_18_GPIO_PIN_MASK                        (1U << 19U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M7F */

#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_15_IOMUX 0x00U /*!< IOMUXC XBAR_INOUT15 function direction select: XBAR_INOUT as input */
#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_23_IOMUX 0x00U /*!< IOMUXC XBAR_INOUT23 function direction select: XBAR_INOUT as input */
#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_8_IOMUX 0x00U /*!< IOMUXC XBAR_INOUT8 function direction select: XBAR_INOUT as input */
#define XBAR_DIR_CTRL1_IOMUXC_XBAR_DIR_SEL_9_IOMUX 0x00U /*!< IOMUXC XBAR_INOUT9 function direction select: XBAR_INOUT as input */

/* GPIO_EMC_B1_12 (coord G6), M1_PWM_AT */
/* Routed pin properties */
#define BOARD_INITPWM_M1_PWM_AT_PERIPHERAL                                  PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_M1_PWM_AT_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPWM_M1_PWM_AT_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_EMC_B1_13 (coord F3), M1_PWM_AB */
/* Routed pin properties */
#define BOARD_INITPWM_M1_PWM_AB_PERIPHERAL                                  PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_M1_PWM_AB_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPWM_M1_PWM_AB_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_EMC_B1_14 (coord G5), M1_PWM_BT */
/* Routed pin properties */
#define BOARD_INITPWM_M1_PWM_BT_PERIPHERAL                                  PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_M1_PWM_BT_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPWM_M1_PWM_BT_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_EMC_B1_15 (coord G2), M1_PWM_BB */
/* Routed pin properties */
#define BOARD_INITPWM_M1_PWM_BB_PERIPHERAL                                  PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_M1_PWM_BB_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPWM_M1_PWM_BB_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_EMC_B1_17 (coord E2), M1_PWM_CT */
/* Routed pin properties */
#define BOARD_INITPWM_M1_PWM_CT_PERIPHERAL                                  PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_M1_PWM_CT_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPWM_M1_PWM_CT_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_EMC_B1_16 (coord H1), M1_PWM_CB */
/* Routed pin properties */
#define BOARD_INITPWM_M1_PWM_CB_PERIPHERAL                                  PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_M1_PWM_CB_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPWM_M1_PWM_CB_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_SD_B1_03 (coord C15), M1_OC_FAULT */
/* Routed pin properties */
#define BOARD_INITPWM_M1_OC_FAULT_PERIPHERAL                                PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_M1_OC_FAULT_SIGNAL                                   FAULT   /*!< Signal name */
#define BOARD_INITPWM_M1_OC_FAULT_CHANNEL                                     0U   /*!< Signal channel */

