Masmiseim36/nxpSDK/boards/frdmimxrt1186/ecat_examples/dual_cores_servo_motor/cm7/pin_mux.h
/* GPIO_EMC_B1_39 (coord P1), M1_OV_FAULT */
/* Routed pin properties */
#define BOARD_INITPWM_M1_OV_FAULT_PERIPHERAL                                PWM4   /*!< Peripheral name */
#define BOARD_INITPWM_M1_OV_FAULT_SIGNAL                                   FAULT   /*!< Signal name */
#define BOARD_INITPWM_M1_OV_FAULT_CHANNEL                                     1U   /*!< Signal channel */

/* GPIO_EMC_B1_18 (coord D1), M2_PWM_AT */
/* Routed pin properties */
#define BOARD_INITPWM_M2_PWM_AT_PERIPHERAL                                  PWM2   /*!< Peripheral name */
#define BOARD_INITPWM_M2_PWM_AT_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPWM_M2_PWM_AT_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_EMC_B1_19 (coord F4), M2_PWM_AB */
/* Routed pin properties */
#define BOARD_INITPWM_M2_PWM_AB_PERIPHERAL                                  PWM2   /*!< Peripheral name */
#define BOARD_INITPWM_M2_PWM_AB_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPWM_M2_PWM_AB_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_EMC_B1_20 (coord G1), M2_PWM_BT */
/* Routed pin properties */
#define BOARD_INITPWM_M2_PWM_BT_PERIPHERAL                                  PWM2   /*!< Peripheral name */
#define BOARD_INITPWM_M2_PWM_BT_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPWM_M2_PWM_BT_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_EMC_B1_21 (coord K4), M2_PWM_BB */
/* Routed pin properties */
#define BOARD_INITPWM_M2_PWM_BB_PERIPHERAL                                  PWM2   /*!< Peripheral name */
#define BOARD_INITPWM_M2_PWM_BB_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPWM_M2_PWM_BB_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_EMC_B1_23 (coord F1), M2_PWM_CT */
/* Routed pin properties */
#define BOARD_INITPWM_M2_PWM_CT_PERIPHERAL                                  PWM2   /*!< Peripheral name */
#define BOARD_INITPWM_M2_PWM_CT_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPWM_M2_PWM_CT_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_EMC_B1_22 (coord L3), M2_PWM_CB */
/* Routed pin properties */
#define BOARD_INITPWM_M2_PWM_CB_PERIPHERAL                                  PWM2   /*!< Peripheral name */
#define BOARD_INITPWM_M2_PWM_CB_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPWM_M2_PWM_CB_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_EMC_B1_05 (coord H6), M2_OC_FAULT */
/* Routed pin properties */
#define BOARD_INITPWM_M2_OC_FAULT_PERIPHERAL                                PWM2   /*!< Peripheral name */
#define BOARD_INITPWM_M2_OC_FAULT_SIGNAL                                   FAULT   /*!< Signal name */
#define BOARD_INITPWM_M2_OC_FAULT_CHANNEL                                     0U   /*!< Signal channel */

/* GPIO_EMC_B1_04 (coord J4), M2_OV_FAULT */
/* Routed pin properties */
#define BOARD_INITPWM_M2_OV_FAULT_PERIPHERAL                                PWM2   /*!< Peripheral name */
#define BOARD_INITPWM_M2_OV_FAULT_SIGNAL                                   FAULT   /*!< Signal name */
#define BOARD_INITPWM_M2_OV_FAULT_CHANNEL                                     1U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPWM(void);                     /* Function assigned for the Cortex-M7F */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLPUART(void);                  /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B1_00 (coord H3), M1_ENDATA_DATA_IN_ENC_A */
/* Routed pin properties */
#define BOARD_INITENC_M1_ENDATA_DATA_IN_ENC_A_PERIPHERAL                 FLEXIO1   /*!< Peripheral name */
#define BOARD_INITENC_M1_ENDATA_DATA_IN_ENC_A_SIGNAL                          IO   /*!< Signal name */
#define BOARD_INITENC_M1_ENDATA_DATA_IN_ENC_A_CHANNEL                         0U   /*!< Signal channel */

/* GPIO_EMC_B1_01 (coord H4), M1_ENDAT_DIR_ENC_B */
/* Routed pin properties */
#define BOARD_INITENC_M1_ENDAT_DIR_ENC_B_PERIPHERAL                      FLEXIO1   /*!< Peripheral name */
#define BOARD_INITENC_M1_ENDAT_DIR_ENC_B_SIGNAL                               IO   /*!< Signal name */
#define BOARD_INITENC_M1_ENDAT_DIR_ENC_B_CHANNEL                              1U   /*!< Signal channel */

/* GPIO_EMC_B1_03 (coord G3), M1_ENDAT_DATA_OUT_ENC_HOME */
/* Routed pin properties */
#define BOARD_INITENC_M1_ENDAT_DATA_OUT_ENC_HOME_PERIPHERAL              FLEXIO1   /*!< Peripheral name */
#define BOARD_INITENC_M1_ENDAT_DATA_OUT_ENC_HOME_SIGNAL                       IO   /*!< Signal name */
#define BOARD_INITENC_M1_ENDAT_DATA_OUT_ENC_HOME_CHANNEL                      3U   /*!< Signal channel */

/* GPIO_EMC_B1_02 (coord K2), M1_ENDAT_CLK_ENC_I */
/* Routed pin properties */
#define BOARD_INITENC_M1_ENDAT_CLK_ENC_I_PERIPHERAL                      FLEXIO1   /*!< Peripheral name */
#define BOARD_INITENC_M1_ENDAT_CLK_ENC_I_SIGNAL                               IO   /*!< Signal name */
#define BOARD_INITENC_M1_ENDAT_CLK_ENC_I_CHANNEL                              2U   /*!< Signal channel */

/* GPIO_AD_15 (coord N16), M2_ENDATA_DATA_IN_ENC_A */
/* Routed pin properties */
#define BOARD_INITENC_M2_ENDATA_DATA_IN_ENC_A_PERIPHERAL                 FLEXIO2   /*!< Peripheral name */
#define BOARD_INITENC_M2_ENDATA_DATA_IN_ENC_A_SIGNAL                          IO   /*!< Signal name */
#define BOARD_INITENC_M2_ENDATA_DATA_IN_ENC_A_CHANNEL                        15U   /*!< Signal channel */

/* GPIO_AD_14 (coord N14), M2_ENDAT_DIR_ENC_B */
/* Routed pin properties */
#define BOARD_INITENC_M2_ENDAT_DIR_ENC_B_PERIPHERAL                      FLEXIO2   /*!< Peripheral name */
#define BOARD_INITENC_M2_ENDAT_DIR_ENC_B_SIGNAL                               IO   /*!< Signal name */
#define BOARD_INITENC_M2_ENDAT_DIR_ENC_B_CHANNEL                             14U   /*!< Signal channel */

/* GPIO_AD_12 (coord P17), M2_ENDAT_DATA_OUT_ENC_HOME */
/* Routed pin properties */
#define BOARD_INITENC_M2_ENDAT_DATA_OUT_ENC_HOME_PERIPHERAL              FLEXIO2   /*!< Peripheral name */
#define BOARD_INITENC_M2_ENDAT_DATA_OUT_ENC_HOME_SIGNAL                       IO   /*!< Signal name */
#define BOARD_INITENC_M2_ENDAT_DATA_OUT_ENC_HOME_CHANNEL                     12U   /*!< Signal channel */

