Masmiseim36/nxpSDK/boards/frdmimxrt1186/ecat_examples/dual_cores_servo_motor/cm7/pin_mux.h
/* GPIO_AD_13 (coord N15), M2_ENDAT_CLK_ENC_I */
/* Routed pin properties */
#define BOARD_INITENC_M2_ENDAT_CLK_ENC_I_PERIPHERAL                      FLEXIO2   /*!< Peripheral name */
#define BOARD_INITENC_M2_ENDAT_CLK_ENC_I_SIGNAL                               IO   /*!< Signal name */
#define BOARD_INITENC_M2_ENDAT_CLK_ENC_I_CHANNEL                             13U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENC(void);                     /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B1_10 (coord E3), M1_SINC_CUR_A */
/* Routed pin properties */
#define BOARD_INITSINC_M1_SINC_CUR_A_PERIPHERAL                            SINC3   /*!< Peripheral name */
#define BOARD_INITSINC_M1_SINC_CUR_A_SIGNAL                                EMBIT   /*!< Signal name */
#define BOARD_INITSINC_M1_SINC_CUR_A_CHANNEL                                  3U   /*!< Signal channel */

/* GPIO_EMC_B1_08 (coord H5), M1_SINC_CUR_B */
/* Routed pin properties */
#define BOARD_INITSINC_M1_SINC_CUR_B_PERIPHERAL                            SINC3   /*!< Peripheral name */
#define BOARD_INITSINC_M1_SINC_CUR_B_SIGNAL                                EMBIT   /*!< Signal name */
#define BOARD_INITSINC_M1_SINC_CUR_B_CHANNEL                                  2U   /*!< Signal channel */

/* GPIO_EMC_B1_06 (coord K3), M1_SINC_VOLT_DCB */
/* Routed pin properties */
#define BOARD_INITSINC_M1_SINC_VOLT_DCB_PERIPHERAL                         SINC3   /*!< Peripheral name */
#define BOARD_INITSINC_M1_SINC_VOLT_DCB_SIGNAL                             EMBIT   /*!< Signal name */
#define BOARD_INITSINC_M1_SINC_VOLT_DCB_CHANNEL                               1U   /*!< Signal channel */

/* GPIO_B2_05 (coord A9), M1_SINC_CLK1 */
/* Routed pin properties */
#define BOARD_INITSINC_M1_SINC_CLK1_PERIPHERAL                             SINC3   /*!< Peripheral name */
#define BOARD_INITSINC_M1_SINC_CLK1_SIGNAL                               MOD_CLK   /*!< Signal name */
#define BOARD_INITSINC_M1_SINC_CLK1_CHANNEL                                   1U   /*!< Signal channel */

/* GPIO_B2_11 (coord B9), M2_SINC_CUR_A */
/* Routed pin properties */
#define BOARD_INITSINC_M2_SINC_CUR_A_PERIPHERAL                            SINC2   /*!< Peripheral name */
#define BOARD_INITSINC_M2_SINC_CUR_A_SIGNAL                                EMBIT   /*!< Signal name */
#define BOARD_INITSINC_M2_SINC_CUR_A_CHANNEL                                  3U   /*!< Signal channel */

/* GPIO_B2_09 (coord D10), M2_SINC_CUR_B */
/* Routed pin properties */
#define BOARD_INITSINC_M2_SINC_CUR_B_PERIPHERAL                            SINC2   /*!< Peripheral name */
#define BOARD_INITSINC_M2_SINC_CUR_B_SIGNAL                                EMBIT   /*!< Signal name */
#define BOARD_INITSINC_M2_SINC_CUR_B_CHANNEL                                  2U   /*!< Signal channel */

/* GPIO_AD_29 (coord L15), M2_SINC_VOLT_DCB */
/* Routed pin properties */
#define BOARD_INITSINC_M2_SINC_VOLT_DCB_PERIPHERAL                         SINC2   /*!< Peripheral name */
#define BOARD_INITSINC_M2_SINC_VOLT_DCB_SIGNAL                             EMBIT   /*!< Signal name */
#define BOARD_INITSINC_M2_SINC_VOLT_DCB_CHANNEL                               1U   /*!< Signal channel */

/* GPIO_B2_04 (coord C9), M2_SINC_CLK0 */
/* Routed pin properties */
#define BOARD_INITSINC_M2_SINC_CLK0_PERIPHERAL                             SINC2   /*!< Peripheral name */
#define BOARD_INITSINC_M2_SINC_CLK0_SIGNAL                               MOD_CLK   /*!< Signal name */
#define BOARD_INITSINC_M2_SINC_CLK0_CHANNEL                                   0U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSINC(void);                    /* Function assigned for the Cortex-M7F */

/* GPIO_EMC_B1_00 (coord H3), M1_ENDATA_DATA_IN_ENC_A */
/* Routed pin properties */
#define BOARD_INITENC_COPY_1_M1_ENDATA_DATA_IN_ENC_A_PERIPHERAL          FLEXIO1   /*!< Peripheral name */
#define BOARD_INITENC_COPY_1_M1_ENDATA_DATA_IN_ENC_A_SIGNAL                   IO   /*!< Signal name */
#define BOARD_INITENC_COPY_1_M1_ENDATA_DATA_IN_ENC_A_CHANNEL                  0U   /*!< Signal channel */

/* GPIO_EMC_B1_01 (coord H4), M1_ENDAT_DIR_ENC_B */
/* Routed pin properties */
#define BOARD_INITENC_COPY_1_M1_ENDAT_DIR_ENC_B_PERIPHERAL               FLEXIO1   /*!< Peripheral name */
#define BOARD_INITENC_COPY_1_M1_ENDAT_DIR_ENC_B_SIGNAL                        IO   /*!< Signal name */
#define BOARD_INITENC_COPY_1_M1_ENDAT_DIR_ENC_B_CHANNEL                       1U   /*!< Signal channel */

/* GPIO_EMC_B1_03 (coord G3), M1_ENDAT_DATA_OUT_ENC_HOME */
/* Routed pin properties */
#define BOARD_INITENC_COPY_1_M1_ENDAT_DATA_OUT_ENC_HOME_PERIPHERAL       FLEXIO1   /*!< Peripheral name */
#define BOARD_INITENC_COPY_1_M1_ENDAT_DATA_OUT_ENC_HOME_SIGNAL                IO   /*!< Signal name */
#define BOARD_INITENC_COPY_1_M1_ENDAT_DATA_OUT_ENC_HOME_CHANNEL               3U   /*!< Signal channel */

/* GPIO_EMC_B1_02 (coord K2), M1_ENDAT_CLK_ENC_I */
/* Routed pin properties */
#define BOARD_INITENC_COPY_1_M1_ENDAT_CLK_ENC_I_PERIPHERAL               FLEXIO1   /*!< Peripheral name */
#define BOARD_INITENC_COPY_1_M1_ENDAT_CLK_ENC_I_SIGNAL                        IO   /*!< Signal name */
#define BOARD_INITENC_COPY_1_M1_ENDAT_CLK_ENC_I_CHANNEL                       2U   /*!< Signal channel */

/* GPIO_AD_15 (coord N16), M2_ENDATA_DATA_IN_ENC_A */
/* Routed pin properties */
#define BOARD_INITENC_COPY_1_M2_ENDATA_DATA_IN_ENC_A_PERIPHERAL          FLEXIO2   /*!< Peripheral name */
#define BOARD_INITENC_COPY_1_M2_ENDATA_DATA_IN_ENC_A_SIGNAL                   IO   /*!< Signal name */
#define BOARD_INITENC_COPY_1_M2_ENDATA_DATA_IN_ENC_A_CHANNEL                 15U   /*!< Signal channel */

/* GPIO_AD_14 (coord N14), M2_ENDAT_DIR_ENC_B */
/* Routed pin properties */
#define BOARD_INITENC_COPY_1_M2_ENDAT_DIR_ENC_B_PERIPHERAL               FLEXIO2   /*!< Peripheral name */
#define BOARD_INITENC_COPY_1_M2_ENDAT_DIR_ENC_B_SIGNAL                        IO   /*!< Signal name */
#define BOARD_INITENC_COPY_1_M2_ENDAT_DIR_ENC_B_CHANNEL                      14U   /*!< Signal channel */

/* GPIO_AD_12 (coord P17), M2_ENDAT_DATA_OUT_ENC_HOME */
/* Routed pin properties */
#define BOARD_INITENC_COPY_1_M2_ENDAT_DATA_OUT_ENC_HOME_PERIPHERAL       FLEXIO2   /*!< Peripheral name */
#define BOARD_INITENC_COPY_1_M2_ENDAT_DATA_OUT_ENC_HOME_SIGNAL                IO   /*!< Signal name */
#define BOARD_INITENC_COPY_1_M2_ENDAT_DATA_OUT_ENC_HOME_CHANNEL              12U   /*!< Signal channel */

/* GPIO_AD_13 (coord N15), M2_ENDAT_CLK_ENC_I */
/* Routed pin properties */
#define BOARD_INITENC_COPY_1_M2_ENDAT_CLK_ENC_I_PERIPHERAL               FLEXIO2   /*!< Peripheral name */
#define BOARD_INITENC_COPY_1_M2_ENDAT_CLK_ENC_I_SIGNAL                        IO   /*!< Signal name */
#define BOARD_INITENC_COPY_1_M2_ENDAT_CLK_ENC_I_CHANNEL                      13U   /*!< Signal channel */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
